## Connect to the local database where Pagila is loaded

In [1]:
# Drop the existing pagila database
!PGPASSWORD=student dropdb -h 127.0.0.1 -U student pagila

In [3]:
# Create the pagila db and fill it with data 
!PGPASSWORD=student createdb -h 127.0.0.1 -U student pagila

In [5]:
!PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila -c "\du"

                                   List of roles
 Role name |                         Attributes                         | Member of
-----------+------------------------------------------------------------+-----------
 jennydo   | Superuser, Create role, Create DB, Replication, Bypass RLS | {}
 student   | Create DB                                                  | {}

In [7]:
!PGPASSWORD=jennydo psql -q -h 127.0.0.1 -U jennydo -d pagila -f "/Users/jennydo/Library/CloudStorage/OneDrive-UniversityofWollongong/JRM project/pagila-schema.sql"
!PGPASSWORD=jennydo psql -q -h 127.0.0.1 -U jennydo -d pagila -f "/Users/jennydo/Library/CloudStorage/OneDrive-UniversityofWollongong/JRM project/pagila-data.sql"

 set_config
------------

(1 row)

 set_config
------------

(1 row)

 setval
--------
    200
(1 row)

 setval
--------
    605
(1 row)

 setval
--------
     16
(1 row)

 setval
--------
    600
(1 row)

 setval
--------
    109
(1 row)

 setval
--------
    599
(1 row)

 setval
--------
   1000
(1 row)

 setval
--------
   4581
(1 row)

 setval
--------
      6
(1 row)

 setval
--------
  32098
(1 row)

 setval
--------
  16049
(1 row)

 setval
--------
   1500
(1 row)

 setval
--------
    500
(1 row)

## Connect to the newly created db

In [12]:
%load_ext sql

In [14]:
DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'student'
DB_PASSWORD = 'student'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)

postgresql://student:student@127.0.0.1:5432/pagila

In [16]:
%sql $conn_string

## Create and populate the star schema

### Explore the 3NF Schema
![3NF schema](https://video.udacity-data.com/topher/2021/August/61120e06_pagila-3nf/pagila-3nf.png)

In [103]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [26]:
nStores = %sql select count(*) from store;
nFilms = %sql select count(*) from film;
nCustomers = %sql select count(*) from customer;
nRentals = %sql select count(*) from rental;
nPayment = %sql select count(*) from payment;
nStaff = %sql select count(*) from staff;
nCity = %sql select count(*) from city;
nCountry = %sql select count(*) from country;

print("nFilms\t\t=", nFilms[0][0])
print("nCustomers\t=", nCustomers[0][0])
print("nRentals\t=", nRentals[0][0])
print("nPayment\t=", nPayment[0][0])
print("nStaff\t\t=", nStaff[0][0])
print("nStores\t\t=", nStores[0][0])
print("nCities\t\t=", nCity[0][0])
print("nCountry\t\t=", nCountry[0][0])

 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.
 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.
nFilms		= 1000
nCustomers	= 599
nRentals	= 16044
nPayment	= 16049
nStaff		= 1500
nStores		= 500
nCities		= 600
nCountry		= 109

In [36]:
%%sql  
select min(payment_date) as start, max(payment_date) as end from payment;

 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.

[(datetime.datetime(2022, 1, 24, 0, 3, 52, 212496, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600))), datetime.datetime(2022, 7, 27, 20, 39, 20, 739759, tzinfo=datetime.timezone(datetime.timedelta(seconds=36000))))]

In [38]:
%%sql
select district,  sum(address) as n
from address
group by district
order by n desc
limit 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
(psycopg2.errors.UndefinedFunction) function sum(text) does not exist
LINE 1: select district,  sum(address) as n
                          ^
HINT:  No function matches the given name and argument types. You might need to add explicit type casts.

[SQL: select district,  sum(address) as n
from address
group by district
order by n desc
limit 10;]
(Background on this error at: https://sqlalche.me/e/20/f405)

## Basic data analysis

### 1. Top Grossing Movies

#### Films

In [50]:
%%sql
select film_id, title, release_year, rental_rate, rating  from film limit 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
10 rows affected.

[(1, 'ACADEMY DINOSAUR', 2012, Decimal('0.99'), 'PG'),
 (2, 'ACE GOLDFINGER', 2023, Decimal('4.99'), 'G'),
 (3, 'ADAPTATION HOLES', 2017, Decimal('2.99'), 'NC-17'),
 (4, 'AFFAIR PREJUDICE', 2023, Decimal('2.99'), 'G'),
 (5, 'AFRICAN EGG', 2019, Decimal('2.99'), 'G'),
 (6, 'AGENT TRUMAN', 2010, Decimal('2.99'), 'PG'),
 (7, 'AIRPLANE SIERRA', 2019, Decimal('4.99'), 'PG-13'),
 (8, 'AIRPORT POLLOCK', 2010, Decimal('4.99'), 'R'),
 (9, 'ALABAMA DEVIL', 2011, Decimal('2.99'), 'PG-13'),
 (10, 'ALADDIN CALENDAR', 2014, Decimal('4.99'), 'NC-17')]

#### Payments

In [53]:
%%sql
select * from payment limit 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
10 rows affected.

[(16051, 269, 1, 98, Decimal('0.99'), datetime.datetime(2022, 1, 29, 12, 58, 52, 222594, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600)))),
 (16065, 274, 1, 147, Decimal('2.99'), datetime.datetime(2022, 1, 25, 23, 14, 16, 895377, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600)))),
 (16109, 297, 2, 143, Decimal('0.99'), datetime.datetime(2022, 1, 28, 11, 49, 49, 128218, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600)))),
 (16195, 344, 2, 157, Decimal('2.99'), datetime.datetime(2022, 1, 31, 16, 58, 51, 176578, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600)))),
 (16202, 348, 2, 821, Decimal('0.99'), datetime.datetime(2022, 1, 27, 3, 52, 41, 359433, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600)))),
 (16216, 357, 2, 945, Decimal('0.99'), datetime.datetime(2022, 1, 24, 11, 39, 9, 52005, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600)))),
 (16237, 369, 1, 31, Decimal('4.99'), datetime.datetime(2022, 1, 31, 11, 12, 16, 422091, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600)))),
 (16247, 372, 1, 617, Decimal('2.99'), datetime.datetime(2022, 1, 29, 23, 51, 46, 565326, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600)))),
 (16249, 373, 2, 257, Decimal('4.99'), datetime.datetime(2022, 1, 29, 16, 33, 33, 142744, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600)))),
 (16259, 379, 2, 209, Decimal('4.99'), datetime.datetime(2022, 1, 31, 10, 2, 6, 818362, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600))))]

#### Inventory

In [60]:
%%sql
select * from inventory limit 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
10 rows affected.

[(1, 1, 1, datetime.datetime(2022, 2, 15, 21, 9, 17, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600)))),
 (2, 1, 1, datetime.datetime(2022, 2, 15, 21, 9, 17, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600)))),
 (3, 1, 1, datetime.datetime(2022, 2, 15, 21, 9, 17, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600)))),
 (4, 1, 1, datetime.datetime(2022, 2, 15, 21, 9, 17, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600)))),
 (5, 1, 2, datetime.datetime(2022, 2, 15, 21, 9, 17, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600)))),
 (6, 1, 2, datetime.datetime(2022, 2, 15, 21, 9, 17, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600)))),
 (7, 1, 2, datetime.datetime(2022, 2, 15, 21, 9, 17, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600)))),
 (8, 1, 2, datetime.datetime(2022, 2, 15, 21, 9, 17, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600)))),
 (9, 2, 2, datetime.datetime(2022, 2, 15, 21, 9, 17, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600)))),
 (10, 2, 2, datetime.datetime(2022, 2, 15, 21, 9, 17, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600))))]

#### Get the movie of every payment

In [63]:
%%sql
SELECT f.title, p.amount, p.payment_date, p.customer_id                                            
FROM payment p
JOIN rental r    ON ( p.rental_id = r.rental_id )
JOIN inventory i ON ( r.inventory_id = i.inventory_id )
JOIN film f ON ( i.film_id = f.film_id)
limit 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[('PACKER MADIGAN', Decimal('0.99'), datetime.datetime(2022, 1, 29, 12, 58, 52, 222594, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600))), 269),
 ('CHARIOTS CONSPIRACY', Decimal('2.99'), datetime.datetime(2022, 1, 25, 23, 14, 16, 895377, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600))), 274),
 ('CRAFT OUTFIELD', Decimal('0.99'), datetime.datetime(2022, 1, 28, 11, 49, 49, 128218, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600))), 297),
 ('CRUSADE HONEY', Decimal('2.99'), datetime.datetime(2022, 1, 31, 16, 58, 51, 176578, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600))), 344),
 ('ROMAN PUNK', Decimal('0.99'), datetime.datetime(2022, 1, 27, 3, 52, 41, 359433, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600))), 348)]

#### Sum movie rental revenue

In [66]:
%%sql
SELECT f.title, sum(p.amount) as revenue                                            
FROM payment p
JOIN rental r    ON ( p.rental_id = r.rental_id )
JOIN inventory i ON ( r.inventory_id = i.inventory_id )
JOIN film f ON ( i.film_id = f.film_id)
GROUP BY title
ORDER BY revenue desc
limit 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
10 rows affected.

[('TELEGRAPH VOYAGE', Decimal('231.73')),
 ('WIFE TURN', Decimal('223.69')),
 ('ZORRO ARK', Decimal('214.69')),
 ('GOODFELLAS SALUTE', Decimal('209.69')),
 ('SATURDAY LAMBS', Decimal('204.72')),
 ('TITANS JERK', Decimal('201.71')),
 ('TORQUE BOUND', Decimal('198.72')),
 ('HARRY IDAHO', Decimal('195.70')),
 ('INNOCENT USUAL', Decimal('191.74')),
 ('HUSTLER PARTY', Decimal('190.78'))]

### 2. Top Grossing Cities

#### Get the city of each payment

In [72]:
%%sql
SELECT p.customer_id, p.rental_id, p.amount, ci.city
FROM payment p
JOIN customer c ON ( p.customer_id = c.customer_id )
JOIN address a ON ( c.address_id = a.address_id )
JOIN city ci ON ( a.city_id = ci.city_id )
order by p.payment_date
limit 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
10 rows affected.

[(427, 8182, Decimal('3.99'), 'Guaruj'),
 (180, 2798, Decimal('2.99'), 'Pereira'),
 (426, 10172, Decimal('10.99'), 'Purnea (Purnia)'),
 (295, 2054, Decimal('2.99'), 'Kolpino'),
 (172, 1507, Decimal('0.99'), 'Batman'),
 (277, 6487, Decimal('5.99'), 'Ogbomosho'),
 (2, 8705, Decimal('5.99'), 'San Bernardino'),
 (108, 4082, Decimal('2.99'), 'Huixquilucan'),
 (141, 13470, Decimal('4.99'), 'Fukuyama'),
 (43, 8376, Decimal('4.99'), 'Faaa')]

#### Top grossing cities

In [76]:
%%sql
SELECT ci.city ,  sum(p.amount) as revenue
FROM payment p
JOIN customer c  ON ( p.customer_id = c.customer_id )
JOIN address a ON ( c.address_id = a.address_id )
JOIN city ci ON ( a.city_id = ci.city_id )
group by ci.city
order by revenue desc
limit 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
10 rows affected.

[('Cape Coral', Decimal('221.55')),
 ('Saint-Denis', Decimal('216.54')),
 ('Aurora', Decimal('198.50')),
 ('Molodetno', Decimal('195.58')),
 ('Santa Brbara dOeste', Decimal('194.61')),
 ('Apeldoorn', Decimal('194.61')),
 ('Qomsheh', Decimal('186.62')),
 ('London', Decimal('180.52')),
 ('Ourense (Orense)', Decimal('177.60')),
 ('Bijapur', Decimal('175.61'))]

### Revenue of a movie by customer city and by month

#### Total revenue by month

In [84]:
%%sql
SELECT sum(p.amount) as revenue, EXTRACT(month FROM p.payment_date) as month
from payment p
group by month
order by revenue desc
limit 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
7 rows affected.

[(Decimal('11369.00'), Decimal('3')),
 (Decimal('11362.25'), Decimal('5')),
 (Decimal('10886.50'), Decimal('6')),
 (Decimal('10807.36'), Decimal('4')),
 (Decimal('10149.03'), Decimal('2')),
 (Decimal('9879.27'), Decimal('7')),
 (Decimal('2963.10'), Decimal('1'))]

#### Each movie by customer city and by month (data cube)

In [90]:
%%sql
SELECT f.title, p.amount, p.customer_id, ci.city, p.payment_date, EXTRACT(month FROM p.payment_date) as month
FROM payment p
JOIN rental r     ON ( p.rental_id = r.rental_id )
JOIN inventory i  ON ( r.inventory_id = i.inventory_id )
JOIN film  f      ON ( i.film_id = f.film_id)
JOIN customer c   ON ( p.customer_id = c.address_id )
JOIN address a    ON ( c.address_id = a.address_id )
JOIN city ci      ON ( a.city_id = ci.city_id )
order by p.payment_date
limit 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
10 rows affected.

[('TOMORROW HUSTLER', Decimal('3.99'), 427, 'Laohekou', datetime.datetime(2022, 1, 24, 0, 3, 52, 212496, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600))), Decimal('1')),
 ('EXPRESS LONELY', Decimal('2.99'), 180, 'Skikda', datetime.datetime(2022, 1, 24, 0, 24, 17, 906429, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600))), Decimal('1')),
 ('MAIDEN HOME', Decimal('10.99'), 426, 'Pudukkottai', datetime.datetime(2022, 1, 24, 0, 42, 35, 952907, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600))), Decimal('1')),
 ('GANDHI KWAI', Decimal('2.99'), 295, 'Valle de la Pascua', datetime.datetime(2022, 1, 24, 0, 43, 42, 505434, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600))), Decimal('1')),
 ('MAJESTIC FLOATS', Decimal('0.99'), 172, 'Jinchang', datetime.datetime(2022, 1, 24, 0, 57, 4, 87741, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600))), Decimal('1')),
 ('SWEDEN SHINING', Decimal('5.99'), 277, 'Yantai', datetime.datetime(2022, 1, 24, 1, 5, 24, 118128, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600))), Decimal('1')),
 ('OPERATION OPERATION', Decimal('2.99'), 108, 'Toulon', datetime.datetime(2022, 1, 24, 1, 44, 27, 976362, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600))), Decimal('1')),
 ('PINOCCHIO SIMON', Decimal('4.99'), 141, 'Apeldoorn', datetime.datetime(2022, 1, 24, 2, 6, 30, 830136, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600))), Decimal('1')),
 ('SHAWSHANK BUBBLE', Decimal('4.99'), 43, 'Vila Velha', datetime.datetime(2022, 1, 24, 2, 16, 12, 762605, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600))), Decimal('1')),
 ('SHOOTIST SUPERFLY', Decimal('0.99'), 449, 'Tartu', datetime.datetime(2022, 1, 24, 2, 20, 2, 390905, tzinfo=datetime.timezone(datetime.timedelta(seconds=39600))), Decimal('1'))]

#### Sum of revenue of each movie by customer city and by month

In [93]:
%%sql
SELECT f.title, ci.city,EXTRACT(month FROM p.payment_date) as month, sum(p.amount) as revenue
FROM payment p
JOIN rental r    ON ( p.rental_id = r.rental_id )
JOIN inventory i ON ( r.inventory_id = i.inventory_id )
JOIN film f ON ( i.film_id = f.film_id)
JOIN customer c  ON ( p.customer_id = c.customer_id )
JOIN address a ON ( c.address_id = a.address_id )
JOIN city ci ON ( a.city_id = ci.city_id )
group by (f.title, ci.city, month)
order by month, revenue desc
limit 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
10 rows affected.

[('WONDERLAND CHRISTMAS', 'Hodeida', Decimal('1'), Decimal('10.99')),
 ('PATHS CONTROL', 'Yamuna Nagar', Decimal('1'), Decimal('10.99')),
 ('BRIGHT ENCOUNTERS', 'Allende', Decimal('1'), Decimal('10.99')),
 ('FLINTSTONES HAPPINESS', 'Baku', Decimal('1'), Decimal('10.99')),
 ('MAIDEN HOME', 'Purnea (Purnia)', Decimal('1'), Decimal('10.99')),
 ('DESERT POSEIDON', 'Sawhaj', Decimal('1'), Decimal('9.99')),
 ('GOODFELLAS SALUTE', 'Talavera', Decimal('1'), Decimal('9.99')),
 ('ELEPHANT TROJAN', 'al-Hawiya', Decimal('1'), Decimal('9.99')),
 ('FLINTSTONES HAPPINESS', 'Kolpino', Decimal('1'), Decimal('9.99')),
 ('HALL CASSIDY', 'Bag', Decimal('1'), Decimal('9.99'))]

## Creating Facts and Dimensions

![Star Schema](https://video.udacity-data.com/topher/2021/August/61120d38_pagila-star/pagila-star.png)

In [184]:
%%sql
CREATE TABLE dimDate(
    date_key      integer NOT NULL PRIMARY KEY,
    date          date NOT NULL,
    year          smallint NOT NULL,
    quarter       smallint NOT NULL,
    month         smallint NOT NULL,
    day           smallint NOT NULL,
    week          smallint NOT NULL,
    is_weekend    boolean);
CREATE TABLE dimMovie(
    movie_key        SERIAL PRIMARY KEY,
    film_id          smallint NOT NULL,
    title            varchar(255) NOT NULL,
    description      text,
    release_year     year,
    language         varchar(100) NOT NULL,
    original_language varchar(100),
    rental_duration  float NOT NULL,
    length           float NOT NULL,
    rating           varchar(5) NOT NULL,
    special_features varchar(100) NOT NULL);
CREATE TABLE dimStore(
    store_key           SERIAL PRIMARY KEY,
    store_id            integer NOT NULL,
    address             varchar(100) NOT NULL,
    address2            varchar(100),
    district            varchar(60) NOT NULL,
    city                varchar(60) NOT NULL,
    country             varchar(60) NOT NULL,
    postal_code         varchar(20),
    manager_first_name  varchar(60) NOT NULL,
    manager_last_name   varchar(60) NOT NULL, 
    start_date          date NOT NULL,
    end_date            date NOT NULL);
CREATE TABLE dimCustomer(
    customer_key     SERIAL PRIMARY KEY,
    customer_id      integer NOT NULL,
    first_name       varchar(60) NOT NULL,
    last_name        varchar(60) NOT NULL,
    email            varchar(255),
    address          varchar(100) NOT NULL,
    address2         varchar(100),
    district         varchar(60) NOT NULL,
    city             varchar(60) NOT NULL,
    country          varchar(60) NOT NULL,
    postal_code      varchar(20),
    phone            varchar(20) NOT NULL,
    active           smallint NOT NULL,
    create_date      timestamp NOT NULL,
    start_date       date NOT NULL,
    end_date         date NOT NULL);
CREATE TABLE factSales(
    sales_key       SERIAL PRIMARY KEY,
    date_key        INT NOT NULL REFERENCES dimDate(date_key),
    customer_key    INT NOT NULL REFERENCES dimCustomer(customer_key),
    movie_key       INT NOT NULL REFERENCES dimMovie(movie_key),
    store_key       INT NOT NULL REFERENCES dimStore(store_key),
    sales_amount    decimal(5,2) NOT NULL);

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.
Done.
Done.
Done.
Done.

[]

## ETL the data from 3NF tables to Facts & Dimension Tables

In [186]:
%%sql
INSERT INTO dimDate(date_key, date, year, quarter, month, day, week, is_weekend)
SELECT DISTINCT(TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer) AS date_key,
        date(payment_date)                                          AS date,
        EXTRACT(year FROM payment_date)                             AS year,
        EXTRACT(quarter FROM payment_date)                          AS quarter,
        EXTRACT(month FROM payment_date)                            AS month,
        EXTRACT(day FROM payment_date)                              AS day,
        EXTRACT(week FROM payment_date)                             AS week,
        CASE WHEN EXTRACT (ISODOW FROM payment_date) IN (6, 7) THEN true ELSE false END AS is_weekend
FROM payment;

 * postgresql://student:***@127.0.0.1:5432/pagila
185 rows affected.

[]

In [188]:
%%sql
INSERT INTO dimCustomer(customer_key, customer_id, first_name, last_name, email, address, address2, district, city, country, postal_code, phone, active, create_date, start_date, end_date) 
SELECT c.customer_id AS customer_key, 
        c.customer_id,
        c.first_name,
        c.last_name,
        c.email,
        a.address,
        a.address2,
        a.district,
        ci.city,
        co.country,
        a.postal_code,
        a.phone,
       c.active,
       c.create_date,
       now()         AS start_date,
       now()         AS end_date
FROM customer c
JOIN address a  ON (c.address_id = a.address_id)
JOIN city ci    ON (a.city_id = ci.city_id)
JOIN country co ON (ci.country_id = co.country_id);

 * postgresql://student:***@127.0.0.1:5432/pagila
599 rows affected.

[]

In [190]:
%%sql
INSERT INTO dimMovie (movie_key, film_id, title, description, release_year, language, original_language, rental_duration, length, rating, special_features)
SELECT f.film_id      AS movie_key,
       f.film_id,
       f.title,
       f.description,
       f.release_year,
       l.name         AS language,
       orig_lang.name AS original_language,
       f.rental_duration,
       f.length,
       f.rating,
       f.special_features
FROM film f
JOIN language l              ON (f.language_id=l.language_id)
LEFT JOIN language orig_lang ON (f.original_language_id = orig_lang.language_id);

 * postgresql://student:***@127.0.0.1:5432/pagila
1000 rows affected.

[]

In [192]:
%%sql
INSERT INTO dimStore (store_key, store_id, address, address2, district, city, country, postal_code, manager_first_name, manager_last_name, start_date, end_date)
SELECT s.store_id    AS store_key,
       s.store_id,
       a.address,
       a.address2,
       a.district,
       c.city,
       co.country,
       a.postal_code,
       st.first_name AS manager_first_name,
       st.last_name  AS manager_last_name,
       now()         AS start_date,
       now()         AS end_date
FROM store s
JOIN staff st   ON (s.manager_staff_id = st.staff_id)
JOIN address a  ON (s.address_id = a.address_id)
JOIN city c     ON (a.city_id = c.city_id)
JOIN country co ON (c.country_id = co.country_id);

 * postgresql://student:***@127.0.0.1:5432/pagila
500 rows affected.

[]

In [194]:
%%sql

INSERT INTO factSales (date_key, customer_key, movie_key, store_key, sales_amount)
SELECT TO_CHAR(p.payment_date :: DATE, 'yyyyMMDD')::integer AS date_key ,
       p.customer_id                                        AS customer_key,
       i.film_id                                            AS movie_key,
       i.store_id                                           AS store_key,
       p.amount                                             AS sales_amount
FROM payment p
JOIN rental r    ON ( p.rental_id = r.rental_id )
JOIN inventory i ON ( r.inventory_id = i.inventory_id );

 * postgresql://student:***@127.0.0.1:5432/pagila
16049 rows affected.

[]

## Repeat the computation from the facts & dimension table

In [205]:
%%sql
SELECT sales_key, movie_key, date_key, customer_key, sales_amount
FROM factSales
LIMIT 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
10 rows affected.

[(1, 651, 20220129, 269, Decimal('0.99')),
 (2, 138, 20220125, 274, Decimal('2.99')),
 (3, 186, 20220128, 297, Decimal('0.99')),
 (4, 197, 20220131, 344, Decimal('2.99')),
 (5, 741, 20220127, 348, Decimal('0.99')),
 (6, 315, 20220124, 357, Decimal('0.99')),
 (7, 979, 20220131, 369, Decimal('4.99')),
 (8, 900, 20220129, 372, Decimal('2.99')),
 (9, 563, 20220129, 373, Decimal('4.99')),
 (10, 159, 20220131, 379, Decimal('4.99'))]

In [210]:
%%time
%%sql
SELECT sales_key, movie_key, date_key, customer_key, sales_amount
FROM factSales
LIMIT 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
10 rows affected.
CPU times: user 2.63 ms, sys: 2.17 ms, total: 4.8 ms
Wall time: 4.41 ms

In [212]:
%%time
%%sql
SELECT dimMovie.title, dimDate.month, dimCustomer.city, sales_amount
FROM factSales 
JOIN dimMovie on (dimMovie.movie_key = factSales.movie_key)
JOIN dimDate on (dimDate.date_key = factSales.date_key)
JOIN dimCustomer on (dimCustomer.customer_key = factSales.customer_key)
limit 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.
CPU times: user 5.05 ms, sys: 3.16 ms, total: 8.21 ms
Wall time: 14.2 ms

In [214]:
%%time
%%sql
SELECT dimMovie.title, dimDate.month, dimCustomer.city, sum(sales_amount) as revenue
FROM factSales 
JOIN dimMovie    on (dimMovie.movie_key      = factSales.movie_key)
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
JOIN dimCustomer on (dimCustomer.customer_key = factSales.customer_key)
group by (dimMovie.title, dimDate.month, dimCustomer.city)
order by dimMovie.title, dimDate.month, dimCustomer.city, revenue desc;

 * postgresql://student:***@127.0.0.1:5432/pagila
16017 rows affected.
CPU times: user 23.6 ms, sys: 6.13 ms, total: 29.7 ms
Wall time: 63.3 ms

In [216]:
%%time
%%sql
SELECT f.title, EXTRACT(month FROM p.payment_date) as month, ci.city, sum(p.amount) as revenue
FROM payment p
JOIN rental r    ON ( p.rental_id = r.rental_id )
JOIN inventory i ON ( r.inventory_id = i.inventory_id )
JOIN film f ON ( i.film_id = f.film_id)
JOIN customer c  ON ( p.customer_id = c.customer_id )
JOIN address a ON ( c.address_id = a.address_id )
JOIN city ci ON ( a.city_id = ci.city_id )
group by (f.title, month, ci.city)
order by f.title, month, ci.city, revenue desc;

 * postgresql://student:***@127.0.0.1:5432/pagila
16017 rows affected.
CPU times: user 23.7 ms, sys: 5.03 ms, total: 28.8 ms
Wall time: 106 ms

In [222]:
!PGPASSWORD=jennydo pg_dump -h 127.0.0.1 -U jennydo pagila > "/Users/jennydo/Library/CloudStorage/OneDrive-UniversityofWollongong/JRM project/pagila-star.sql"